# Создать класс Point, описывающий точку(атрибуты: x, y).
# Создать класс Figure. Создать три дочерних класса Circle(атрибуты: координаты центра(тип Point),
# длина радиуса; методы: нахождение периметра и площади окружности), Triangle(атрибуты: три точки,
# методы: нахождение площади и периметра), Square(атрибуты: две точки, методы: нахождение площади и периметра).
# При потребности создавать все необходимые методы не описанные в задании.
# Создать список фигур и в цикле подсчитать и вывести площади всех фигур на экран[my-oop-03]
# Примечание: в рамках задание создать два файла: classes.py и main.py.
# первом будут описаны все классы, во втором классы будут импортированы и использованы.
